const i18n_fa = {
    general: {
        title: 'کیف پول DPX',
        language: 'فارسی',
        yes: 'بله',
        no: 'خیر',
    },
    login: {
        title: 'به کیف پول DPX خوش آمدید',
        description: 'برای شروع لازم است که یک کیف پول جدید ایجاد کنید یا اگر از قبل کیف پول دارید، می‌توانید آن‌را وارد کنید',
        buttons: {
            import: 'وارد کردن کیف پول',
            create: 'ایجاد کیف پول',
        }
    },
    settings: {
        language: {
            title: 'زبان',
            description: 'زبان مورد نظر خود را تنظیم کنید',
        },
        copyright: 'توسعه یافته توسط عرفان مولا با استفاده از TeleVue',
    },
    wallet: {
        title: {
            wallet: 'کیف پول',
            import: 'وارد کردن کیف پول',
        },
        fields: {
            wallet: 'آدرس کیف پول',
            secret: 'عبارت محرمانه',
        },
        import_wallet: 'افزودن کیف پول',
        save_wallet: 'ذخیره کیف پول',
        hint: 'از این بخش می‌توانید کیف پول خود را وارد کنید، کیف پول و عبارت محرمانه هر دو متشکل از 32 کاراکتر می‌باشند، می‌توانید در صورت داشتن QRCode آن‌ها را اسکن نمایید.',
        revoke_secret: 'بازنشانی عبارت محرمانه',
        clear_session: 'پاک کردن کیف پول از این دستگاه',
        scan_wallet: 'آدرس QR کیف پول را اسکن نمایید',
        scan_secret: 'مقدار QR عبارت محرمانه را اسکن نمایید',
        toast: {
            wallet_saved: 'کیف پول با موفقیت ذخیره شد',
            wallet_imported: 'کیف پول با موفقیت وارد شد',
            secret_revoked: 'عبارت محرمانه با موفقیت بازنشانی و ذخیره شد',
        },
        prompt: {
            revoke_secret: {
                title: 'بازنشانی عبارت محرمانه',
                text: 'آیا قصد دارید عبارت محرمانه کیف پول‌تان بازنشانی شود؟',
            },
            clear_session: {
                title: 'پاک کردن کیف پول',
                text: 'آیا قصد دارید این کیف پول را از دستگاه خود پاک کنید؟',
            },
        }
    },
};

export default i18n_fa;
